Revit 2026 API

# DocumentLoadFamilySymbol(String, String) Method

---

Loads only a specified family type/symbol from a family file into the document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool LoadFamilySymbol(
	string filename,
	string name
)
```
```vb
Public Function LoadFamilySymbol (
	filename As String,
	name As String
) As Boolean
```
```cpp
public:
bool LoadFamilySymbol(
	String^ filename,
	String^ name
)
```
```fsharp
member LoadFamilySymbol :
        filename : string *
        name : string -> bool
```

#### Parameters

filename String
    The fully qualified filename of the Family file, usually ending in .rfa.
name String
    The name of the type/symbol to be loaded, such as "W11x14".

#### Return Value

BooleanTrue if the family type/symbol was loaded successfully into the project, otherwise False.

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when filename or name is  or empty. |

This function supports loading of types/symbols stored in the family, or those available in the family Type Catalog file.

#### Reference

Document Class

LoadFamilySymbol Overload

Autodesk.Revit.DB Namespace